USE [master]
GO

-- 1. Production өгөгдлийн санг үүсгэх.
IF DB_ID('Production') IS NOT NULL
DROP DATABASE Production
GO

CREATE DATABASE Production
GO

SELECT *
FROM sys.databases
GO

USE Production
GO

-- 2. Order хүснэгтийг үүсгэх
CREATE TABLE [Order] (
	ID int identity(1, 1) PRIMARY KEY,
	ProductID varchar (4) not null,
	ProductName nvarchar (40) not null,
	ProductType nvarchar (40) not null,
	Unit nvarchar (10) null,
	Qty int not null,
	UnitPrice money not null,
	OrderDate smalldatetime not null,
)
GO

-- 3. Дараах өгөгдлийг Order хүснэгтэд оруулах.
INSERT INTO [Order]
VALUES
('bt01', N'Зууван цех талх', N'Боов талх', N'ш', 2, 750, '2008/02/17'),
('hn01', N'Буриад төмс', N'Хүнсний ногоо', N'кг', 3, 600, '2008/02/17'),
('ga01', N'Саван', N'Гэр ахуйн бараа', N'ш', 1, 350, '2008/02/17'),
('ga02', N'Гэрлийн ламп', N'Гэр ахуйн бараа', N'ш', 3, 500, '2008/02/18'),
('hn02', N'Лууван', N'Хүнсний ногоо', N'кг', 5, 800, '2008/02/18'),
('hn03', N'Улаан төмс', N'Хүнсний ногоо', N'кг', 10, 1000, '2008/02/18'),
('hn04', N'Цагаан лууван', N'Хүнсний ногоо', N'кг', 1, 1200, '2008/02/19'),
('bt02', N'Сүүтэй талх', N'Боов талх', N'ш', 2, 780, '2008/02/20'),
('ga03', N'Нүүр гарын саван', N'Гэр ахуйн бараа', N'ш', 3, 450, '2008/02/20'),
('ga04', N'Шүдний ОО', N'Гэр ахуйн бараа', N'ш', 1, 1500, '2008/02/21'),
('ga05', N'Шүдэнз', N'Гэр ахуйн бараа', N'ш', 1, 350, '2008/02/21'),
('bt03', N'Хивэгтэй талх', N'Боов талх', N'ш', 2, 770, '2008/02/21'),
('bt04', N'Хөх тарианы талх', N'Боов талх', N'ш', 4, 650, '2008/02/22'),
('hn04', N'Цагаан лууван', N'Хүнсний ногоо', N'кг', 2, 1200, '2008/02/22'),
('ga01', N'Саван', N'Гэр ахуйн бараа', N'ш', 5, 350, '2008/02/22'),
('bt02', N'Сүүтэй талх', N'Боов талх', N'ш', 2, 780, '2008/02/22'),
('ga02', N'Гэрлийн ламп', N'Гэр ахуйн бараа', N'ш', 1, 500, '2008/02/22'),
('hn01', N'Буриад төмс', N'Хүнсний ногоо', N'кг', 15, 600, '2008/02/23'),
('bt01', N'Зууван цех талх', N'Боов талх', N'ш', 2, 750, '2008/02/24'),
('ga02', N'Гэрлийн ламп', N'Гэр ахуйн бараа', N'ш', 1, 500, '2008/02/25')
GO

SELECT DISTINCT ProductName
FROM [Order]
ORDER BY ProductName
GO

-- 4. Захиалгын хүснэгтэд нийт хэдэн бараа байгааг харуулах.
SELECT DISTINCT ProductName
FROM [Order]
GO

-- 5. Боов Талх төрлийн бараануудыг харуулах.
SELECT DISTINCT ProductName
FROM [Order]
WHERE ProductType LIKE N'Боов талх'
GO

-- 6. Захиалга болгоны нийт үнийг [Нийт үнэ] гэсэн нэртэй шинэ багана үүсгэж харуулах.
ALTER TABLE [Order]
ADD [Нийт үнэ] AS (Qty * UnitPrice)
GO

SELECT *
FROM [Order]
GO

-- 7. Барааны нэр, Захиалсан тоог хэмжих нэгжтэй болгож харуул Жнь: Цагаан лууван - 2кг

GO

-- 8. Хүнсний ногоонд ямар ямар бараа байгааг давхцуулалгүй харуулах.

GO

-- 9. Гэрлийн ламп нийт хэдэн ширхэгийг захиалсныг харуулах.

GO

-- 10. Нийт хэдэн төгрөгний үнэтэй Хүнсний ногоо захиалсны харуулах.

GO

-- 11. 2008.02.20-с хойш өнөөдрийг хүртэл ямар ямар бараа захиалсныг харуулах.

GO

-- 12. ‘талх’ гэсэн үг орсон бүх бараануудыг харуулах.
SELECT ProductName
FROM [Order]
WHERE ProductName LIKE N'талх%%%'
GO

-- 13. Нийт захиалгын хүснэгтэнд хэдэн төгрөгний үнэтэй бараа захиалсныг бодож гаргах.

GO

-- 14. ширхэгээр хэмждэггүй бараануудыг харуулах.

GO

-- 15. tblBaraaTurul гэсэн хүснэгт үүсгэн түүнрүү барааны төрлийг давхардуулалгүйгээр хадгалах.


GO

-- 16. Хүнсний ногоо төрлийн бараанаас хамгийн их захиалсан 1 барааг харуулах.

GO

-- 17. Хамгийн сүүлд захиалсан Сүүтэй талхны Захиалсан өдрийг олох.

GO

-- 18. С, Ш үсгээр эхэлсэн бараануудыг сонгож харуулах.

GO

-- 19. Саван, Шүдэнз, Лууван гэсэн бараануудыг захиалсан захиалгуудыг харуулах.

GO

-- 20. Бараа болгон нийт хэдийн хэмжээтэй захиалсныг харуулах.

GO

-- 21. 2008.02.19-2008.02.22 хооронд захиалсан баруунуудыг бараа болгоны нийт захиалсан хэмжээг group хийж харуулах.

GO

-- 22. Бараа болгоныг group хийж олсон нийт захиалсан хэмжээ нь 5-с их бараануудыг харуулах.

GO

-- 23. Барааны төрөл тус бүр хэдэн бараа захиалсаныг group хийж харуулах.

GO

-- 24. Бараа тус бүр хэдэн удаа захиалагдсаныг харуулах. Жнь: Гэрлийн ламп 3 удаа.

GO